# Document Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIDocument..::..Document Property
UIDocument Class See Also
---
Returns the database level document represented by this UI-level document.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Document Document { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Document As Document
	Get
```

Visual C++
---
```text
public:
property Document^ Document {
	Document^ get ();
}
```

# See Also
UIDocument Class
Autodesk.Revit.UI Namespace